ghye/stm32_car/lw_gprs.c
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>

#include "stm32f10x.h" //"stm32f10x_nvic.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_usart.h"

#include "lw_gprs.h"
#include "lw_stm32_uart.h"

#define GPRS_MAX_MSG_LEN 512 //64
#define GPS_MAX_MSG_LEN 0xff

#define M_RST GPIO_Pin_8
#define M_ON GPIO_Pin_9
#define MG323_RESET() 	GPIO_SetBits(GPIOC, M_RST) /* 硬件复位>= 10ms */
#define MG323_NORM() GPIO_ResetBits(GPIOC, M_RST)
#define MG323_POWERSWITCH() GPIO_SetBits(GPIOC, M_ON)	/*开/关切换>=1s*/
#define MG323_POWERNORM() GPIO_ResetBits(GPIOC, M_ON)

#define ATE0 "ATE0\x00D\x00A"
#define CHECK_COPN "AT+COPN=?"
#define GET_CONPN "AT+COPN"
#define CHECK_COPS "AT+COPS=?"
#define GET_REGESTERED_COPS "AT+COPS?"
#define SET_CREG "AT+CREG=0" /* 8.3.3 */

#define CHECK_SICS "AT^SICS=?\x00D\x00A"	/* 10.1.1 */
#define SET_NETTYPE "AT^SICS=0,conType,GPRS0\x00D\x00A"	/* 10.1.3 */
#define SET_APNTYPE "AT^SICS=0,apn,3GNET\x00D\x00A"
#define SET_SRVTYPE "AT^SISS=0,srvType,Socket\x00D\x00A"
#define SET_CONID "AT^SISS=0,conId,0\x00D\x00A"
#define SET_SRV_URL_1 "AT^SISS=0,address,\"socktcp://113.105.139.109:6969\"\x00D\x00A"
//#define SET_SRV_URL_1 "AT^SISS=0,address,\"socktcp://203.88.202.116:7788\"\x00D\x00A"
#define OPEN_CON0 "AT^SISO=0\x00D\x00A"
#define CLOSE_CON0 "AT^SISC=0\x00D\x00A"
#define GET_IMEI "AT+CGSN\x00D\x00A"



#define GPRS_RXNE_IRQ_ENABLE() USART_ITConfig(USART1, USART_IT_RXNE, ENABLE)
#define GPRS_RXNE_IRQ_DISABLE() USART_ITConfig(USART1, USART_IT_RXNE, DISABLE)

typedef enum{
	GPRS_STATUS_NOINIT,
	GRPS_STATUS_START,	/* 等待GPRS模块发送^SYSSTART */
	GPRS_STATUS_ATE,
	GPRS_STATUS_GET_IMEI,
	GPRS_STATUS_NETTYPE,
	GPRS_STATUS_APNTYPE,
	GPRS_STATUS_SRVTYPE,
	GPRS_STATUS_CONID,
	GPRS_STATUS_SRVURL,
	GPRS_STATUS_SOCKET_OPEN,
	GPRS_STATUS_SOCKET_WRITE,
	GPRS_STATUS_SOCKET_WRITE_MSG,
	GPRS_STATUS_SOCKET_WILL_CLOSED,
	GPRS_STATUS_SOCKET_READ,
	GPRS_STATUS_SOCKET_CLOSE,

	GPRS_STATUS_MAX,
}GPRS_MODULE_STATUS;

struct _gprs_info{
	bool ate0;
	uint8_t imei[15];
	GPRS_MODULE_STATUS gprs_status;
	struct {
		bool quit_socket;
		bool sec_msg;	/* 第二次发送数据 */
		bool socket_opend;
		bool socket_closed_by_srv;
		uint32_t session_max_len;
	}send_status;
	struct {
		uint8_t rbuf[GPRS_MAX_MSG_LEN];
		/*uint8_t*/ uint16_t rbuf_index;
	}rbuf_info;
	uint32_t tmpbuf_len;
	uint32_t tmpbuf2_len;
	uint8_t tmpbuf[GPRS_MAX_MSG_LEN];
	uint8_t tmpbuf2[GPRS_MAX_MSG_LEN];
	struct {
		uint8_t sbuf[GPRS_MAX_MSG_LEN];
		uint8_t sbuf_len;
		uint8_t gps_sbuf[GPS_MAX_MSG_LEN];
		uint8_t gps_sbuf_len;
	}sbuf_info;
};
struct _gprs_info gprs_info;

static void lw_clean_gprs_sbuf(void)
{
	gprs_info.sbuf_info.sbuf_len = 0;
	memset(gprs_info.sbuf_info.sbuf, 0, GPRS_MAX_MSG_LEN);
}

void lw_set_gprs_sbuf(uint8_t *msg)
{
	gprs_info.sbuf_info.sbuf_len = strlen(msg);
	strcpy(gprs_info.sbuf_info.sbuf, msg);
}

int32_t lw_is_sbuf_empty(void)
{
	return ((gprs_info.sbuf_info.sbuf_len > 0) ? 0:1);
}

static void lw_clean_gprs_rbuf(void)
{
	USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
	memset(gprs_info.rbuf_info.rbuf, 0, sizeof(gprs_info.rbuf_info.rbuf)/sizeof(gprs_info.rbuf_info.rbuf[0]));
	gprs_info.rbuf_info.rbuf_index = 0;
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
}

void lw_gprs_init(void)
{
	com_para_t com_para;
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOC, ENABLE);
	//RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOC, ENABLE);//测试

	GPIO_InitStructure.GPIO_Pin = M_RST|M_ON;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	MG323_POWERSWITCH();
	MG323_NORM();


	//测试
	/*GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_10;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_SetBits(GPIOA, GPIO_Pin_9);
	GPIO_SetBits(GPIOA, GPIO_Pin_10);	*/
	
	/* uart init */	
	com_para.baudrate = 115200;
	com_para.data_9bit = false;
	com_para.parity = 0;
	com_para.port = 1;//2;
	com_para.twoStopBits = false;
	com_init(&com_para);
	
}

void lw_start_gprs_mode(void)
{
	memset(&gprs_info, 0, sizeof(gprs_info));
	gprs_info.gprs_status = GPRS_STATUS_NOINIT;
	gprs_info.ate0 = 0;
	gprs_info.send_status.quit_socket = false;
	lw_clean_gprs_sbuf();
	lw_clean_gprs_rbuf();
	
#if 0
	MG323_POWERSWITCH();
	delay(150);	/* >= 1S */
	MG323_POWERNORM();

	MG323_RESET();
	delay(100);	/* >= 10ms */
	MG323_NORM();
#endif
}

//#define gprs_send_cmd(x, y) com_send_string(x, y)
#define gprs_send_cmd(x, y,z ) com_send_nchar(x, y, z)

static void lw_gprs_waitfor_start(void)
{ 
	if(gprs_info.rbuf_info.rbuf_index < 20)
		return;
	if (NULL != strstr(gprs_info.rbuf_info.rbuf, "SYSSTART"))
	{
		memset(&gprs_info, 0, sizeof(gprs_info));
		gprs_info.ate0 = 0;
		gprs_info.gprs_status = GRPS_STATUS_START;
	}

	lw_clean_gprs_rbuf();
	return ;
}

/* 关闭回显*/
static void lw_send_ate0(void)
{
	lw_clean_gprs_rbuf();
	gprs_info.gprs_status = GPRS_STATUS_ATE;
	gprs_send_cmd(1, ATE0, strlen(ATE0));
}

static void lw_send_get_imei(void)
{
	if(gprs_info.rbuf_info.rbuf[2]== 'O' && gprs_info.rbuf_info.rbuf[3] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_GET_IMEI;
		//lw_gprs_get_imei();
		gprs_send_cmd(1, GET_IMEI, strlen(GET_IMEI));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, ATE0, strlen(ATE0));
	}
}

static void lw_send_nettype(void)
{
	if(!lw_gprs_get_imei())
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_NETTYPE;
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, GET_IMEI, strlen(GET_IMEI));
	}
}

static void lw_send_apntype(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_APNTYPE;
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_NETTYPE, strlen(SET_NETTYPE));
	}
}

static void lw_send_srvtype(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_SRVTYPE;
		gprs_send_cmd(1, SET_SRVTYPE, strlen(SET_SRVTYPE));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_APNTYPE, strlen(SET_APNTYPE));
	}

