ghye/stm32_car/lw_gprs.c
}

static void lw_send_conid(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_CONID;
		gprs_send_cmd(1, SET_CONID, strlen(SET_CONID));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_SRVTYPE, strlen(SET_SRVTYPE));
	}
}

static void lw_send_srvurl(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_SRVURL;
		gprs_send_cmd(1, SET_SRV_URL_1, strlen(SET_SRV_URL_1));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_CONID, strlen(SET_CONID));
	}
}

static void lw_send_socket_open(void)
{
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_OPEN;
		gprs_send_cmd(1, OPEN_CON0, strlen(OPEN_CON0));
	}
	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, SET_SRV_URL_1, strlen(SET_SRV_URL_1));
	}
}

uint32_t pow10(uint32_t i)
{
    uint32_t ret;

    ret = 1;
    while(i-->0)
        ret *= 10;
    return ret;
}

static void lw_clear_gprs_ack_sentence(uint8_t *start)
{
	uint16_t tmp;
	uint16_t start_addr;
	uint8_t *p;

	p = start;
	while(*p != 0x0A) 
		p++;
	start_addr = p - gprs_info.rbuf_info.rbuf;
	GPRS_RXNE_IRQ_DISABLE();
	for(tmp = start_addr + 1; tmp < gprs_info.rbuf_info.rbuf_index; tmp++)
		gprs_info.rbuf_info.rbuf[tmp - (start_addr + 1)] = gprs_info.rbuf_info.rbuf[tmp];
	gprs_info.rbuf_info.rbuf_index -= (start_addr + 1);
	memset(gprs_info.rbuf_info.rbuf + gprs_info.rbuf_info.rbuf_index, 0, 
		GPRS_MAX_MSG_LEN - gprs_info.rbuf_info.rbuf_index);
	GPRS_RXNE_IRQ_ENABLE();
}

static void lw_gprs_check_socket_opend(void)
{
	uint8_t i;
	uint8_t *p;
	uint8_t *ptmp;


	if (gprs_info.rbuf_info.rbuf_index < 4)	
		return ;
	if(gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K')
	{
		if(gprs_info.rbuf_info.rbuf_index < 18) /* 没接收完毕*/
			return;
		if((p = memchr(gprs_info.rbuf_info.rbuf, ',', gprs_info.rbuf_info.rbuf_index)) == NULL)
		{
			gprs_info.send_status.session_max_len = 1024;
			return;
		}
		else if((p = memchr(p + 1, ',', 
			gprs_info.rbuf_info.rbuf_index - (p - gprs_info.rbuf_info.rbuf) - 1)) == NULL)
		{
			gprs_info.send_status.session_max_len = 1024;
			return;
		}
		ptmp = p +1;
		if((p = memchr(p +1, 0x0D, 
			gprs_info.rbuf_info.rbuf_index - (p - gprs_info.rbuf_info.rbuf) - 1)) == NULL)
		{
			return;	/* 没接收完毕 */
		}
		if(*(p+1) != 0x0A)
			return;

		*p = '\0';
		gprs_info.send_status.session_max_len = atoi(ptmp);

		gprs_info.send_status.socket_opend = true;
		//lw_clean_gprs_rbuf();
		lw_clear_gprs_ack_sentence(p);
	}
	else if(gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] == 0x0A) /* 接收错误完毕 */
	{
		//lw_clean_gprs_rbuf();
		lw_clear_gprs_ack_sentence(gprs_info.rbuf_info.rbuf + 4);
		gprs_send_cmd(1, OPEN_CON0, strlen(OPEN_CON0));
	}
}


static int32_t lw_gprs_check_socket_send_msg(void)
{
	static bool send_msg_ok = false;

	uint8_t tmp;
	uint8_t *p;

	if(false == send_msg_ok)
	{
	if((gprs_info.rbuf_info.rbuf_index < 6) ||
		(gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] != 0x0A))	 /* "\x00D\x00AOK\x00D\x00A" */
	{
		/* 没接受完毕 */
		return -1;
	}
	else if(gprs_info.rbuf_info.rbuf[2] != 'O')
	{
//com_send_message(2, gprs_info.rbuf_info.rbuf);
		/* 出错了 */
		//lw_clean_gprs_rbuf();
		lw_clear_gprs_ack_sentence(gprs_info.rbuf_info.rbuf + 2);
		send_msg_ok = false;
		return -2;
	}	
	else
	{
		/* 接收到OK以后，还有后面的主动上报信息^SISW: 0,1    或者   ^SISW: 0,1 */
		/*GPRS_RXNE_IRQ_DISABLE();
		for(tmp = 6; tmp < gprs_info.rbuf_info.rbuf_index; tmp++)
			gprs_info.rbuf_info.rbuf[tmp - 6] = gprs_info.rbuf_info.rbuf[tmp];
		gprs_info.rbuf_info.rbuf_index -= 6;
		GPRS_RXNE_IRQ_ENABLE();*/
		lw_clear_gprs_ack_sentence(gprs_info.rbuf_info.rbuf + 4);
		send_msg_ok = true;
	}
	}

	/* 处理自动返回的信息 : ^SISW: 0,1    或者   ^SISW: 0,1 */
	/*if(gprs_info.rbuf_info.rbuf_index < 14)*/
	if (gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] != 0x0A)
	{
		return -1;
	}
	p = memchr(gprs_info.rbuf_info.rbuf, ',', gprs_info.rbuf_info.rbuf_index);
	if(NULL == p)
	{
		lw_clean_gprs_rbuf();
		return -3; /*不可能*/
	}
	if(*(p +1) == '0')
	{
		/* 等待 */
		/*GPRS_RXNE_IRQ_DISABLE();
		for(tmp = 14; tmp < gprs_info.rbuf_info.rbuf_index; tmp++)
			gprs_info.rbuf_info.rbuf[tmp - 14] = gprs_info.rbuf_info.rbuf[tmp];
		gprs_info.rbuf_info.rbuf_index -= 14;
		GPRS_RXNE_IRQ_ENABLE();*/
		lw_clear_gprs_ack_sentence(gprs_info.rbuf_info.rbuf + 10);
		return -1;
	}

	/* 可以继续发送数据了 */
	send_msg_ok = false;
	//lw_clean_gprs_rbuf();
	lw_clear_gprs_ack_sentence(gprs_info.rbuf_info.rbuf + 4);
	return 0;

#if 0
	if(gprs_info.rbuf_info.rbuf[2]== 'O' && gprs_info.rbuf_info.rbuf[3] == 'K')	/* 发送到gprs成功 */
	{
		/* ^SISW: 0,1	如可以写入，GPRS模块主动回复*/
		if(memchr(gprs_info.rbuf_info.rbuf, 'W', GPRS_MAX_MSG_LEN) == NULL ||
			memchr(gprs_info.rbuf_info.rbuf, ',', GPRS_MAX_MSG_LEN) == NULL ||
			gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] != 0x0A) /* 未收到可写信息 ,　等待*/
		{
			com_send_message(2, "recv none SISW, wait..");
			return -1;
		}
		lw_clean_gprs_rbuf();
		return 0;
	}
	else
	{
		/*lw_clean_gprs_rbuf();
		gprs_send_cmd(1, gprs_info.tmpbuf2, gprs_info.tmpbuf2_len);*/

		/* 出错了 */
		lw_clean_gprs_rbuf();
		
		return -2;
	}
#endif
}

static void lw_send_socket_write(uint32_t msglen)
{
/*	if((gprs_info.rbuf_info.rbuf[4]== 'O' && gprs_info.rbuf_info.rbuf[5] == 'K') ||
		gprs_info.send_status.sec_msg )*/
	{
		/*gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN] = '\0';
		com_send_message(2, gprs_info.rbuf_info.rbuf);
		if (strstr(gprs_info.rbuf_info.rbuf, "closed") != NULL){
			gprs_info.send_status.socket_closed_by_srv = true;
			return;
		}*/
	
		//lw_clean_gprs_rbuf();
		//gprs_info.send_status.socket_opend = true;
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_WRITE;
		sprintf(gprs_info.tmpbuf, "AT^SISW=0,%d\x00D\x00A", msglen);
		//sprintf(gprs_info.tmpbuf, "AT^SISW=0,kueiurjiejfnejvimeuvnmenvmienvmkdnvkhvfkjvmkf vdiv nkdvmdvnmjdjnffnfjndvfjdvjfjvfjvdjfnvdjf d vfj djf jdvjfvjvfndjfnvjfjvfjvfjvjfvjfiuejvifuejveivrijfirjfrekjfksjdfkueifuniuceccccccccknvfjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjeuiyruiieunvem,ceincrintmbjnbjgnbhjnjmjrbngjkdfjgikfgjrhgrjhgjrfjgkfjgroooooooooooojjjjjjjjjjjjjjjjjjjjjjjjjklllllllllllirkjjfriufjirujtf847u584\x00D\x00A", msglen);		
		gprs_info.tmpbuf_len = strlen(gprs_info.tmpbuf);
		gprs_send_cmd(1, gprs_info.tmpbuf, strlen(gprs_info.tmpbuf));
	}
/*	else
	{
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, OPEN_CON0, strlen(OPEN_CON0));
	}*/	
}

static bool lw_gprs_is_socket_closed(void)
{
	/* ^SIS: 0,0,48,Remote Peer has closed the connection  服务器主动断开链接*/
	/*if(((ptemp = memchr(gprs_info.rbuf_info.rbuf, 'R', gprs_info.rbuf_info.rbuf_index)) != NULL) &&
		(*(ptemp+1) == 'e') &&
		((ptemp = memchr(ptemp+1, 'c',
			gprs_info.rbuf_info.rbuf_index - (ptemp - gprs_info.rbuf_info.rbuf) - 1)) != NULL) &&
		(*(ptemp+1) == 'l') ){*/
	gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN-1] = '\0';
	com_send_message(2, "::");
	com_send_message(2, gprs_info.rbuf_info.rbuf);
	if (strstr(gprs_info.rbuf_info.rbuf, "closed") != NULL){
		//gprs_info.send_status.socket_closed_by_srv = true;
		return true;
	}

