ghye/stm32_car/lw_gprs.c
	return false;
}

static void lw_send_socket_write_msg(uint8_t *msg, uint32_t msg_len)
{
	#define END_FLAG "\x00D\x00A"
	//static uint8_t test= 0;
	uint8_t *p;
	uint8_t *ptmp;
	uint8_t *ptemp;
	uint8_t *pgprs_data_len;
	//static uint32_t un_ack_data_len = 0;


	
	/* ^SISW: 0,44,44 */
	if((p = memchr(gprs_info.rbuf_info.rbuf, ',', gprs_info.rbuf_info.rbuf_index)) == NULL)
	{
		return; /* 未接收完毕?? */
	}
	pgprs_data_len = p +1;
	if((p = memchr(p + 1, ',', 
		gprs_info.rbuf_info.rbuf_index - (p - gprs_info.rbuf_info.rbuf) - 1)) == NULL)
	{
		return; /* 未接收完毕?? */
	}
	ptmp = p +1;
	if((p = memchr(p +1, 0x0D, 
		gprs_info.rbuf_info.rbuf_index - (p - gprs_info.rbuf_info.rbuf) - 1)) == NULL)
	{
		return;	/* 没接收完毕 */
	}
	if(*(p+1) != 0x0A)
	{
		return;	/* 没接收完毕 */
	}
	
	/*
if(test++>=3)
{
		gprs_info.send_status.socket_closed_by_srv = true;
		return;
}*/		

	*(ptmp - 1) = '\0';
	if(0 == atoi(pgprs_data_len))
	{
		/* gprs返回值指示不能发送时，继续询问 */
		//lw_clean_gprs_rbuf();
		lw_clear_gprs_ack_sentence(pgprs_data_len);
		gprs_send_cmd(1, gprs_info.tmpbuf, gprs_info.tmpbuf_len);
		return;
	}

	*p = '\0';
	if(atoi(ptmp) >= 1680)
	{
		/* 认为断网 */
		com_send_message(2, "gprs socket lost");
		lw_clean_gprs_rbuf();
		return ;
	}
	

	//lw_clean_gprs_rbuf();
	lw_clear_gprs_ack_sentence(pgprs_data_len);
	gprs_info.gprs_status = GPRS_STATUS_SOCKET_WRITE_MSG;
	memcpy(gprs_info.tmpbuf2, msg, msg_len);
	sprintf(gprs_info.tmpbuf2 + msg_len, "%s", END_FLAG);
	gprs_info.tmpbuf2_len = msg_len + strlen(END_FLAG);
	gprs_send_cmd(1, gprs_info.tmpbuf2, gprs_info.tmpbuf2_len);
}

static void lw_send_socket_close(void)
{
/*	if(gprs_info.rbuf_info.rbuf[2]== 'O' && gprs_info.rbuf_info.rbuf[3] == 'K' &&
		gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] == 0x0A)*/
	if((true == gprs_info.send_status.socket_closed_by_srv) ||
		(gprs_info.rbuf_info.rbuf[2]== 'O' && gprs_info.rbuf_info.rbuf[3] == 'K' &&
		gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] == 0x0A))
		
	{
		lw_clean_gprs_rbuf();
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_CLOSE;
		gprs_send_cmd(1, CLOSE_CON0, strlen(CLOSE_CON0));
	}
	else
	{
		/*lw_clean_gprs_rbuf();
		gprs_send_cmd(1, gprs_info.tmpbuf2, gprs_info.tmpbuf2_len);*/
	}
}

static void lw_socked_end(void)
{
	gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN - 1] = '\0';
	if (strstr(gprs_info.rbuf_info.rbuf, "OK") != NULL) {
		gprs_info.gprs_status = /*GPRS_STATUS_SOCKET_OPEN;	*/GPRS_STATUS_NETTYPE;
		memset(&gprs_info.send_status, 0, sizeof(gprs_info.send_status));
		lw_clean_gprs_rbuf();
	}
	else {
		lw_clean_gprs_rbuf();
		gprs_send_cmd(1, CLOSE_CON0, strlen(CLOSE_CON0));
	}
}

static int32_t lw_gprs_get_imei(void)
{
	int32_t i;
	uint8_t tmp[16];
/*		
	if(gprs_info.rbuf_info.rbuf_index < 40) 
	{
		gprs_send_cmd(1, GET_IMEI);
		return -1;
	}*/

	/*com_send_message(1, "imei buf:"); 
	com_send_message(1, gprs_info.rbuf_info.rbuf);*/
		
	while(i++ < gprs_info.rbuf_info.rbuf_index)
	{
		if(gprs_info.rbuf_info.rbuf[i] == 0x0A)
		{
			if(i+15 >=  gprs_info.rbuf_info.rbuf_index)
			{
				//lw_clean_gprs_rbuf();					
				break;
			}
			else if(isdigit(gprs_info.rbuf_info.rbuf[i+1]) && isdigit(gprs_info.rbuf_info.rbuf[i+15]) )
			{
				memcpy(gprs_info.imei, &(gprs_info.rbuf_info.rbuf[i+1]), 15);
				com_send_message(1, "imei:");
				memcpy(tmp, gprs_info.imei, 15);
				tmp[15] = '\0';
				com_send_message(1, tmp);
				return 0;
			}
		}	
	}
	//lw_clean_gprs_rbuf();
	return -1;
}

static bool lw_reset_gprs(void)
{
	uint8_t *p;

	if (true == gprs_info.send_status.socket_closed_by_srv){
		gprs_info.send_status.socket_closed_by_srv = false;
		lw_clean_gprs_rbuf();
		MG323_RESET();
		delay(20);
		MG323_NORM();
	}
	
	gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN - 1] = '\0';
	if ((p = strstr (gprs_info.rbuf_info.rbuf, "SYSSTART")) == NULL)
		return false;
	
	return true;
}

static void lw_check_gprs_stop(void)
{
	static int32_t pre_status = GPRS_STATUS_NOINIT;
	static int32_t g_status_count = 0;

	if (pre_status == gprs_info.gprs_status)
		g_status_count++;
	else {
		pre_status = gprs_info.gprs_status;
		g_status_count = 0;
	}
	if (g_status_count > 1000) {
		MG323_POWERNORM();
		delay(100);
		MG323_POWERSWITCH();
		delay(100);
		g_status_count = 0;
		gprs_info.gprs_status = GPRS_STATUS_NOINIT;
		memset(&gprs_info.send_status, 0, sizeof(gprs_info.send_status));
		lw_clean_gprs_rbuf();
		lw_clean_gprs_sbuf();		
	}
	
}

int32_t lw_gprs_tcp_create_send(void)
{
	int32_t  ret;
	//gprs_info.gprs_status = GPRS_STATUS_NOINIT;

/*	if(lw_is_sbuf_empty())
		return -1;*/
		
/*	if(gprs_info.ate0 == 0)
	{
		com_send_message(1, "\r\n");
		com_send_message(1, "rbuf_index:");
		com_send_hex(1, gprs_info.rbuf_info.rbuf_index);
		com_send_message(1, "\r\n");
		for(i=0;i<gprs_info.rbuf_info.rbuf_index;i++)
			com_send_hex(1, gprs_info.rbuf_info.rbuf[i]);
		com_send_message(1, "\r\n");
		
		if(gprs_info.rbuf_info.rbuf[2] == 'O' && gprs_info.rbuf_info.rbuf[3] == 'K')
		{
			lw_clean_gprs_rbuf();
			gprs_info.ate0 = 1;
		}
		else
		{
			lw_clean_gprs_rbuf();
			lw_send_ate0();
			return -1;
		}
	}*/

	/* 因为gprs模块隔1~1.5分钟就重启 */
	/*if (NULL != strstr(gprs_info.rbuf_info.rbuf, "SYSSTART"))
	{
		gprs_info.ate0 = 0;
		gprs_info.gprs_status = GPRS_STATUS_NOINIT;
		//lw_clean_gprs_rbuf();
		//return -2;
	}*/
	if(gprs_info.rbuf_info.rbuf[0] != 0 &&
		gprs_info.rbuf_info.rbuf[gprs_info.rbuf_info.rbuf_index - 1] !=  0x0A){
		return -1; /* 未接收完信息 */
	}
		
	if (true == lw_gprs_is_socket_closed()){
		gprs_info.send_status.socket_closed_by_srv = true;
		gprs_info.gprs_status = GPRS_STATUS_SOCKET_WILL_CLOSED;
		lw_clean_gprs_rbuf();
		//return -2;
	}

	/* FIXME:遇到过SISR */
	gprs_info.rbuf_info.rbuf[GPRS_MAX_MSG_LEN - 1] = '\0';
	if (strstr(gprs_info.rbuf_info.rbuf, "^SISR") == gprs_info.rbuf_info.rbuf + 2) {
		lw_clear_gprs_ack_sentence(gprs_info.rbuf_info.rbuf + 2);	/* 删除这个 */
		return -1;
	}

